Table of Contents
 Interface IImporterHook
Namespace
IdeaStatiCa.BimApiLink.Hooks
Assembly
IdeaStatiCa.BimApiLink.dll
public interface IImporterHook
Methods
 EnterCreate(IIdentifier)
void EnterCreate(IIdentifier identifier)
Parameters
identifier IIdentifier
 ExitCreate(IIdentifier, IIdeaObject)
void ExitCreate(IIdentifier identifier, IIdeaObject ideaObject)
Parameters
identifier IIdentifier
ideaObject IIdeaObject
 Edit this page